
#Использовать "../src"
#Использовать "./plugins"

ЧтениеТекста = Новый ЧтениеТекста("..\src\Классы\ПарсерВстроенногоЯзыка.os");
Исходник = ЧтениеТекста.Прочитать();
ЧтениеТекста.Закрыть();

Плагины = Новый Массив;
Плагины.Добавить(Новый ДетекторНеиспользуемыхПеременных);

ПараметрыПлагинов = Новый Соответствие;

Парсер = Новый ПарсерВстроенногоЯзыка;

ПроизвольноеОкружение = Парсер.Окружение();

// например, контекст формы:
Элемент = Парсер.ЭлементОкружения("ЭтаФорма");
ПроизвольноеОкружение.Переменные.Вставить("ЭтаФорма", Элемент);
// ...
Элемент = Парсер.ЭлементОкружения("РеквизитФормыВЗначение");
ПроизвольноеОкружение.Методы.Вставить("РеквизитФормыВЗначение", Элемент);
// ...

Парсер.Пуск(Исходник, Плагины, ПараметрыПлагинов, ПроизвольноеОкружение);

Для Каждого Ошибка Из Парсер.ТаблицаОшибок() Цикл
	Сообщить(Ошибка.Текст)
КонецЦикла;